In [2]:
import pandas as pd
import pyodbc
import numpy as np
import plotly.express as px
from datetime import datetime
import statsmodels.api as sm

pd.options.display.float_format = '{:,.2f}'.format
pd.options.display.max_columns = 50
pd.options.display.max_rows = 10

def read_query_file(fileName):
    file = open(fileName,'r')
    string = file.read()
    file.close()
    return string

def timestamp():
    return datetime.now().strftime('%Y-%m-%d %I:%M:%S %p')   

def run_query(query):
    cnxn = pyodbc.connect('DSN=edp-workbench-cshub', autocommit=True)
    df = pd.read_sql_query(query,cnxn)
    cnxn.close()
    return df

In [6]:
table = run_query("Select * FROM hive.CARE.l3_asurion_whole_home_offer_agg limit 3")
display(table.head())
display(table.columns)

,sales_offer_date,client_name,sh_cognito_expert_id,dw_agent_master_id,emplid,agent_id,store_id,sales_location_name,onboarding_flg,channel_name,business_unit,lob_name,glow_entries,eligible,offered,accepted,enrolled,declines,declined_already_enroll,declined_already_other,sales_offer_date_par,sub_channel_name
0,2020-08-03,asurion,47920a13-c0a0-41fd-bc63-4224c1285ecb,-1,393504,"-985,996,201,900.00",None,None,0,d2c_call,pss,d2c,5,5,2,0,0,2,0,0,2020-08-03,None
1,2020-08-03,asurion,4bce8ac8-2abf-4011-9a18-306e30cf5189,-1,335648,"-987,096,678,449.00",None,None,0,d2c_call,pss,d2c,24,24,21,2,2,19,0,0,2020-08-03,None
2,2020-08-03,asurion,6587caf7-986e-4f8f-b6c0-5a8b0a2631a1,-1,423275,"-979,498,751,572.00",None,None,0,d2c_call,pss,d2c,12,12,11,0,0,11,0,0,2020-08-03,None

Index(['sales_offer_date', 'client_name', 'sh_cognito_expert_id',
       'dw_agent_master_id', 'emplid', 'agent_id', 'store_id',
       'sales_location_name', 'onboarding_flg', 'channel_name',
       'business_unit', 'lob_name', 'glow_entries', 'eligible', 'offered',
       'accepted', 'enrolled', 'declines', 'declined_already_enroll',
       'declined_already_other', 'sales_offer_date_par', 'sub_channel_name'],
      dtype='object')

In [27]:
run_query("Select business_unit, COUNT(business_unit) FROM hive.CARE.l3_asurion_whole_home_offer_agg GROUP BY business_unit")

C:\Users\austen.moore\AppData\Local\Temp\ipykernel_34704\111251469.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query,cnxn)

  business_unit    _col1
0        retail   120085
1           pss    35397
2          None        0
3    crosstrain       24
4       esc_scm        2
5       instore  1313284
6      mobility    26562
7     undefined      221

In [36]:
test = run_query(read_query_file('SQL\SubqueryDrafting.sql'))
test.head()

C:\Users\austen.moore\AppData\Local\Temp\ipykernel_34704\111251469.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query,cnxn)

,Employee,Date,Total_Eligible,Total_Offered,Total_Accepted,Total_Enrolled,Total_Declined
0,391935,2023-06-25,0,0,0,0,0
1,238349,2023-08-19,0,0,0,0,0
2,433512,2023-06-01,0,0,0,0,0
3,289160,2023-07-28,0,0,0,0,0
4,303732,2023-07-02,0,0,0,0,0

In [39]:
test

,Employee,Date,Total_Eligible,Total_Offered,Total_Accepted,Total_Enrolled,Total_Declined
0,391935,2023-06-25,0,0,0,0,0
1,238349,2023-08-19,0,0,0,0,0
2,433512,2023-06-01,0,0,0,0,0
3,289160,2023-07-28,0,0,0,0,0
4,303732,2023-07-02,0,0,0,0,0
...,...,...,...,...,...,...,...
1133,349064,2023-06-09,0,0,0,0,0
1134,237360,2023-06-26,0,0,0,0,0
1135,303732,2023-08-13,0,0,0,0,0
1136,372740,2023-07-30,0,0,0,0,0
1137,432211,2023-07-05,0,0,0,0,0

In [ ]:
helix_df = run_query("""
           
      SELECT
         *
      FROM hive.care.l3_asurion_helix_search_all_events hae
      WHERE
         lower(hae.helix_lob) = 'soluto'
         --Show only necessary rows
         AND CAST(hae.empid AS BIGINT) = 589355""")

In [ ]:
display(helix_df.columns)
display(helix_df)
helix_df[['eventid','helix_chat_id','helix_sessionid']]
# helix_df['event'].value_counts()

In [ ]:
pd.options.display.max_rows = 50
tables=run_query("""SELECT * FROM INFORMATION_SCHEMA.Columns WHERE column_name  like 'helix_sessionid' and table_schema = 'care' """)
tables

In [ ]:
tables

In [ ]:
helix_results = run_query(read_query_file('SQL\Helix Usage'))

In [ ]:
helix_results['Date'] = pd.to_datetime(helix_results['Date'])
display(helix_results.head(2))
pivot = pd.pivot_table(helix_results,index='Date',values='Sessions With Helix Search')
pivot.plot()

## Scott Meeting 8.18
### Overview so far
1. Anjali set up a ton of meetings on this going forward.
2. Idea is to setup a link to our ChatGPT clone for experts to ask questions instead of using Helix
3. Key Metrics in Order of Percieved Importance so far are
    1. CRT / Sessions Per Hour
    2. Helix/ChatGPT Clone Usage
    3. CXP
    4. SP100 
4. Steps for us so far
    1. They asked me talk about the last pilot results in the Monday Meeting
    2. Help select Test and Controll Experts
    3. Help find all the data we need to run the experiment.

### Questions for Scott
1. Finding eligible experts 
    1. Helix Usage - Has this been done before and where is it.
    2. CXP is it the same for voice and chat? If not who do I need to get with about it
2. Data build out - Talk of using timestamps instead of session ids
    1. Will it have a big effect on accuracy?
    2. Sound much more difficult
    3. Can we make a temp table of our estimated Call for Helix use? Otherwise it'll be computationally expenseive
3. Testing the Experts
    1. Building dataset with the "KeyMetrics_ForGroupSelection.SQL" I want someone to review it once its done who would be best?
    2. Planning on doing a bunch of random trials and backtesting how representative of the population I can get the expert on our key Measures. Does this make sense or do we want another method.